src/cf/Documents/уатЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.уатПланированиеРаботыТС</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПланированиеРаботыТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссКурс</Name>
					<Comment>Кросс-курс взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>(Общ) Сумма взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбеспечениеПланов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоПлану</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатПлановыеЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатПлановыеЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСервиснаяКнижка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСервиснаяКнижка</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Привязана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечениеПланов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРемонта</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автосервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемЗона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрешать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатЗаказПоставщику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	ДокументОснование = ДанныеЗаполнения;
	Ответственный = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
	Поставщик = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойПоставщик");
	Склад = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойСклад");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПланированиеРаботыТС") Тогда
		СтандартнаяОбработка = Ложь;
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		УчитыватьНДС        	= ДанныеЗаполнения.УчитыватьНДС; 
		СуммаВключаетНДС    	= ДанныеЗаполнения.СуммаВключаетНДС;
		Комментарий         	= "Заполнен на основании " + ДанныеЗаполнения;
		ВалютаДокумента 		= ДанныеЗаполнения.ВалютаДокумента;
		ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата(),
			ЭтотОбъект);
		КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
		КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
		
		ВидОперации = Перечисления.уатВидыОперацийЗаказПоставщику.ОбеспечениеПланов;
		
		ЗаполнитьПланПоПлануРемонтов(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаявкаНаРемонт") Тогда
		СтандартнаяОбработка = Ложь;
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		УчитыватьНДС     = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС"));
		СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС"));
		Комментарий         	= "Заполнен на основании " + ДанныеЗаполнения;
		
		ВалютаДокумента 		= уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Организация);
		ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата(),
			ЭтотОбъект);
		КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
		КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
		
		Если ДанныеЗаполнения.СпособРемонта = Перечисления.уатСпособыРемонта.Автосервис Тогда
			Поставщик = ДанныеЗаполнения.Контрагент;
		Иначе
			Склад = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		
		ВидОперации = Перечисления.уатВидыОперацийЗаказПоставщику.Закупка;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
		КонецЦикла;
		
		ЗаполнитьПлановыеЦены(ДанныеЗаполнения.ТС.Модель);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		СтандартнаяОбработка = Ложь;
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		Комментарий         	= "Заполнен на основании " + ДанныеЗаполнения;
		ВалютаДокумента 		= ДанныеЗаполнения.ВалютаДокумента;
		ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДата(),
			ЭтотОбъект);
		КурсВзаиморасчетов      = ВалютаДокументаКурсКратность.Курс;
		КратностьВзаиморасчетов = ВалютаДокументаКурсКратность.Кратность;
		
		ВидОперации = Перечисления.уатВидыОперацийЗаказПоставщику.Закупка;
		
		Если ДанныеЗаполнения.СпособРемонта = Перечисления.уатСпособыРемонта.Автосервис Тогда
			Поставщик = ДанныеЗаполнения.Контрагент;
			Для Каждого ТекСтрока Из ДанныеЗаполнения.СобственныеМатериалы Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекСтрока.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			КонецЦикла;
			УчитыватьНДС     = ДанныеЗаполнения.УчитыватьНДС; 
			СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
		Иначе
			Склад = ДанныеЗаполнения.Контрагент;
			Для Каждого ТекСтрока Из ДанныеЗаполнения.Материалы Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
				НоваяСтрока.Количество = ТекСтрока.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			КонецЦикла;
			УчитыватьНДС     = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
				ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС"));
			СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
				ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС"));
		КонецЕсли;
		
		ЗаполнитьПлановыеЦены(ДанныеЗаполнения.ТС.Модель);
		
	Иначе
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
				ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
				ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеПодразделениеОрганизации");
		КонецЕсли;
	КонецЕсли;
	
	ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КроссКурс            = уатОбщегоНазначенияСервер.ПолучитьКроссКурс(ВалютаДокумента, ВалютаВзаиморасчетов,
		ТекущаяДата(),, ЭтотОбъект);
	СуммаВзаиморасчетов  = уатОбщегоНазначения_проф.СуммаВзаиморасчетовДокумента(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Поставщик) И Не ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ДоговорКонтрагента = уатЗаполнениеДокументов.ПолучитьОсновнойДоговорКонтрагента(Поставщик, "СПоставщиком", Организация);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	уатОбщегоНазначенияТиповые.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", , Отказ, Заголовок);
	Если УчитыватьНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.СтавкаНДС");
	КонецЕсли;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// уатСогласованиеДокументов
	уатСогласованиеДокументовСервер.ПередЗаписью(ЭтотОбъект, РежимЗаписи, Отказ);
	// Конец уатСогласованиеДокументов
	
	СуммаДокумента = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаКурса = '00010101';
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	СвязанныеТовары = Новый ТаблицаЗначений;
	СвязанныеТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СвязанныеТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	СвязанныеТовары.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка"));
	
	ТаблицаПланы = ОбеспечениеПланов.Выгрузить();
	ТаблицаПланы.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка"));
	ТаблицаПланы.Колонки.Добавить("КоличествоПоОбеспечению", Новый ОписаниеТипов("Число"));
	
	ТаблицаТовары = Товары.Выгрузить(, "Номенклатура, Количество, НомерСтроки");
	Если ВидОперации = Перечисления.уатВидыОперацийЗаказПоставщику.ОбеспечениеПланов Тогда
		Документы.уатЗаказПоставщику.ПодготовитьТаблицыТоваровПоОбеспечению(ТаблицаПланы, ТаблицаТовары, СвязанныеТовары);
	КонецЕсли;
	ДополнительныеСвойства.Вставить("СвязанныеТовары",       СвязанныеТовары);
	ДополнительныеСвойства.Вставить("ТаблицаПланы",          ТаблицаПланы);
	ДополнительныеСвойства.Вставить("ТаблицаОстаткиТоваров", ТаблицаТовары);
	
	// Проверка заполнения документа
	ПровестиКонтрольСоответствияНоменклатуры(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация данных документа.
	Документы.уатЗаказПоставщику.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение_проф.ОтразитьЗаказыПоставщику(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль обеспечения потребностей
	Документы.уатЗаказПоставщику.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.уатЗаказПоставщику.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Рассчитывает стоимость заказываемой номенклатуры по данным регистра "Плановые цены номенклатуры"
//
// Параметры:
//  МодельТС - СправочникСсылка.уатМоделиТС - отбор по модели ТС
//
Процедура ЗаполнитьПлановыеЦены(МодельТС = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Количество КАК Количество,
	|	ТаблицаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.Количество КАК Количество,
	|	втНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ ПлановыеЦеныНоменклатурыКонкретные.Цена ЕСТЬ NULL
	|			ТОГДА ПлановыеЦеныНоменклатурыКонкретные.Цена
	|		КОГДА НЕ ПлановыеЦеныНоменклатурыОбщие.Цена ЕСТЬ NULL
	|			ТОГДА ПлановыеЦеныНоменклатурыОбщие.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	СправочникНоменклатура.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПлановыеЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							втноменклатура.Номенклатура
	|						ИЗ
	|							втНоменклатура КАК втноменклатура)
	|					И Модель = ЗНАЧЕНИЕ(Справочник.уатМоделиТС.ПустаяСсылка)
	|					И Валюта = &Валюта) КАК ПлановыеЦеныНоменклатурыОбщие
	|		ПО втНоменклатура.Номенклатура = ПлановыеЦеныНоменклатурыОбщие.Номенклатура
	|			И втНоменклатура.ЕдиницаИзмерения = ПлановыеЦеныНоменклатурыОбщие.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПлановыеЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							втноменклатура.Номенклатура
	|						ИЗ
	|							втНоменклатура КАК втноменклатура)
	|					И Модель = &МодельТС
	|					И Валюта = &Валюта) КАК ПлановыеЦеныНоменклатурыКонкретные
	|		ПО втНоменклатура.Номенклатура = ПлановыеЦеныНоменклатурыКонкретные.Номенклатура
	|			И втНоменклатура.ЕдиницаИзмерения = ПлановыеЦеныНоменклатурыКонкретные.ЕдиницаИзмерения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО втНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка");
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", Товары.Выгрузить(, "Номенклатура, Количество, ЕдиницаИзмерения"));
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("МодельТС", МодельТС);
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента);
	
	НоменклатураСЦенами = Запрос.Выполнить().Выгрузить();
	
	Товары.Загрузить(НоменклатураСЦенами);
	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет обеспечение плана закупок у поставщика по плану ремонтов
//
// Параметры:
//  ПланРемонтов - ДокументСсылка.уатПланированиеРаботыТС - план ремонтов
//
Процедура ЗаполнитьПланПоПлануРемонтов(ПланРемонтов) Экспорт
	
	ХарактеристикиСценария = уатОбщегоНазначения_проф.ЗаполнитьХарактеристикиСценария(ПланРемонтов.Сценарий);
	
	Если ХарактеристикиСценария.флРемонтыИТО И ХарактеристикиСценария.флНоменклатураТО Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(уатПланированиеРаботыТССоставПлана.Количество) КАК Количество,
		|	уатПланированиеРаботыТССоставПлана.Цена КАК Цена,
		|	СУММА(уатПланированиеРаботыТССоставПлана.Сумма) КАК Сумма,
		|	уатПланированиеРаботыТССоставПлана.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(уатПланированиеРаботыТССоставПлана.СуммаНДС) КАК СуммаНДС,
		|	Товар.Ссылка КАК Номенклатура,
		|	уатПланированиеРаботыТССоставПлана.ВидОбслуживания КАК ВидОбслуживания,
		|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования КАК ДетализацияПланирования
		|ИЗ
		|	Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
		|		ПО уатПланированиеРаботыТССоставПлана.Номенклатура = Товар.Ссылка
		|ГДЕ
		|	уатПланированиеРаботыТССоставПлана.Ссылка = &Ссылка
		|	И уатПланированиеРаботыТССоставПлана.НомерИнтервала = 0
		|	И Товар.Услуга = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПланированиеРаботыТССоставПлана.Цена,
		|	уатПланированиеРаботыТССоставПлана.СтавкаНДС,
		|	Товар.Ссылка,
		|	уатПланированиеРаботыТССоставПлана.ВидОбслуживания,
		|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования";
		Запрос.УстановитьПараметр("Ссылка", ПланРемонтов);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
				НоваяСтрока = ОбеспечениеПланов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				НоваяСтрока.КоличествоПоПлану = ВыборкаДетальныеЗаписи.Количество;
				НоваяСтрока.ТС = ВыборкаДетальныеЗаписи.ДетализацияПланирования;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ХарактеристикиСценария.флРемонтыИТО И Не ХарактеристикиСценария.флНоменклатураТО Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования КАК ДетализацияПланирования,
		|	уатПланированиеРаботыТССоставПлана.ВидОбслуживания КАК ВидОбслуживания
		|ПОМЕСТИТЬ втПлановыеТО
		|ИЗ
		|	Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
		|ГДЕ
		|	уатПланированиеРаботыТССоставПлана.Ссылка = &Ссылка
		|	И уатПланированиеРаботыТССоставПлана.НомерИнтервала = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПлановыеТО.ДетализацияПланирования КАК ДетализацияПланирования,
		|	втПлановыеТО.ВидОбслуживания КАК ВидОбслуживания,
		|	СУММА(1) КАК КоличествоОбслуживания
		|ПОМЕСТИТЬ втКоличествоПлановыхТО
		|ИЗ
		|	втПлановыеТО КАК втПлановыеТО
		|
		|СГРУППИРОВАТЬ ПО
		|	втПлановыеТО.ДетализацияПланирования,
		|	втПлановыеТО.ВидОбслуживания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА уатРаботыПоРемонту.Ссылка ЕСТЬ NULL
		|			ТОГДА уатСервиснаяКнижка.Номенклатура
		|		ИНАЧЕ уатРаботыПоРемонту.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	СУММА(уатСервиснаяКнижка.Количество * втКоличествоПлановыхТО.КоличествоОбслуживания) КАК Количество,
		|	втКоличествоПлановыхТО.ДетализацияПланирования КАК ДетализацияПланирования,
		|	втКоличествоПлановыхТО.ВидОбслуживания КАК ВидОбслуживания
		|ПОМЕСТИТЬ втКоличестваНоменклатуры
		|ИЗ
		|	втКоличествоПлановыхТО КАК втКоличествоПлановыхТО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатСервиснаяКнижка КАК уатСервиснаяКнижка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатРаботыПоРемонту КАК уатРаботыПоРемонту
		|			ПО уатСервиснаяКнижка.Номенклатура = уатРаботыПоРемонту.Ссылка
		|		ПО втКоличествоПлановыхТО.ВидОбслуживания = уатСервиснаяКнижка.ТО
		|			И (ВЫРАЗИТЬ(втКоличествоПлановыхТО.ДетализацияПланирования КАК Справочник.уатТС).Модель = уатСервиснаяКнижка.МодельТС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА уатРаботыПоРемонту.Ссылка ЕСТЬ NULL
		|			ТОГДА уатСервиснаяКнижка.Номенклатура
		|		ИНАЧЕ уатРаботыПоРемонту.Номенклатура
		|	КОНЕЦ,
		|	втКоличествоПлановыхТО.ДетализацияПланирования,
		|	втКоличествоПлановыхТО.ВидОбслуживания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКоличестваНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(втКоличестваНоменклатуры.Количество) КАК Количество,
		|	уатПлановыеЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	СУММА(уатПлановыеЦеныНоменклатурыСрезПоследних.Цена * втКоличестваНоменклатуры.Количество) КАК Сумма,
		|	СправочникНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	втКоличестваНоменклатуры.ДетализацияПланирования КАК ДетализацияПланирования,
		|	втКоличестваНоменклатуры.ВидОбслуживания КАК ВидОбслуживания
		|ИЗ
		|	втКоличестваНоменклатуры КАК втКоличестваНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатПлановыеЦеныНоменклатуры.СрезПоследних(
		|				&ПериодПолученияЦен,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втКоличестваНоменклатуры.Номенклатура
		|					ИЗ
		|						втКоличестваНоменклатуры)) КАК уатПлановыеЦеныНоменклатурыСрезПоследних
		|		ПО втКоличестваНоменклатуры.Номенклатура = уатПлановыеЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И втКоличестваНоменклатуры.ДетализацияПланирования.Модель = уатПлановыеЦеныНоменклатурыСрезПоследних.Модель
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО втКоличестваНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	втКоличестваНоменклатуры.Номенклатура,
		|	уатПлановыеЦеныНоменклатурыСрезПоследних.Цена,
		|	СправочникНоменклатура.СтавкаНДС,
		|	втКоличестваНоменклатуры.ДетализацияПланирования,
		|	втКоличестваНоменклатуры.ВидОбслуживания";
		Запрос.Параметры.Вставить("Ссылка", ПланРемонтов);
		Запрос.Параметры.Вставить("ПериодПолученияЦен", ПланРемонтов.ДатаПланирования);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
				НоваяСтрока = ОбеспечениеПланов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				НоваяСтрока.КоличествоПоПлану = ВыборкаДетальныеЗаписи.Количество;
				НоваяСтрока.ТС = ВыборкаДетальныеЗаписи.ДетализацияПланирования;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС, 
		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	
КонецПроцедуры

Процедура ПровестиКонтрольСоответствияНоменклатуры(Отказ)
	
	Если ВидОперации = Перечисления.уатВидыОперацийЗаказПоставщику.ОбеспечениеПланов Тогда
	
		НастройкиПользователя = Новый Структура();
		НастройкиПользователя.Вставить("Организация",   Организация);
		НастройкиПользователя.Вставить("Подразделение", Подразделение);
		ПроводитьКонтроль = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(НастройкиПользователя,
			ПланыВидовХарактеристик.уатПраваИНастройки.ЗапретПроведенияЗаказовПоставщикуПриНесоответствииНоменклатуры);
		Если ПроводитьКонтроль = Перечисления.уатВидыКонтроля.Предупреждать 
			Или ПроводитьКонтроль = Перечисления.уатВидыКонтроля.Запрещать Тогда
			
			Для Каждого ТекСтрока Из ДополнительныеСвойства.ТаблицаПланы Цикл
				Если ТекСтрока.КоличествоПоПлану > ТекСтрока.КоличествоПоОбеспечению Тогда
					Если ПроводитьКонтроль = Перечисления.уатВидыКонтроля.Запрещать Тогда
						Отказ = Истина;
					КонецЕсли;
					ТекстНСтр = НСтр("ru = 'Для номенклатуры %1 в строке %2 таблицы ""Обеспечение планов"" запланировано на %3 больше, чем заказано'; en = 'For item %1 in row %2 of the ""Plan Provision"" table, %3 more items are planned than ordered.'");
					ТекстНСтр = СтрШаблон(ТекстНСтр, ТекСтрока.Номенклатура, ТекСтрока.НомерСтроки, ТекСтрока.КоличествоПоПлану - ТекСтрока.КоличествоПоОбеспечению);
					ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТекСтрока Из ДополнительныеСвойства.ТаблицаОстаткиТоваров Цикл
				Если ТекСтрока.Количество > 0 Тогда
					Если ПроводитьКонтроль = Перечисления.уатВидыКонтроля.Запрещать Тогда
						Отказ = Истина;
					КонецЕсли;
					ТекстНСтр = НСтр("ru = 'Для номенклатуры %1 в строке %2 таблицы ""Товары"" заказано на %3 больше, чем запланировано'; en = 'For item %1 in row %2 of the ""Products"" table, %3 more items were ordered than planned.'");
					ТекстНСтр = СтрШаблон(ТекстНСтр, ТекСтрока.Номенклатура, ТекСтрока.НомерСтроки, ТекСтрока.Количество);
					ОбщегоНазначения.СообщитьПользователю(ТекстНСтр);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
